---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SunAndShadowSettings
source: html/53022ab0-6e4a-2e4e-1ed8-5eb896ab4091.htm
---
# SunAndShadowSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.